<template>
    <div class="container text-secondary">
        <section class="article">
            <div class="article-body">
                <p>
                    Echo.tj - музыкально-информационный портал идейным вдохновителем которого является Далер Назаров.
                    Цель проекта заключается в сохранении и популяризации музыкального наследия нашей республики во
                    всем его разнообразии. Портал был разработан при участии команды Далера Назарова и разработчиков
                    "Аджоибот". Рекомендуем прочитать письмо Далера Назарова для понимания мотивов, целей и задач проекта.
                </p>
            </div>
        </section>
        <section class="article">
            <h2>
                Письмо Далера Назарова
            </h2>
            <div class="article-body">
                <p>
                    Мы с группой друзей решили создать этот портал, посвящённый музыке Таджикистана.
                    Цель - ознакомить всех желающих с разнообразием того, что у нас есть на сегодняшний день.
                    Сложно охватить и систематизировать то богатство родной культуры,которое нам досталось от
                    предков и то что есть сегодня,потому что музыка разнообразна.
                </p>
                <p>
                    Музыка сама по себе принадлежит всему человечеству, именно для этого она и исполняется.
                    Она принадлежит каждому, кто откроет свое сердце и сможет слиться с ее посланием.
                </p>
                <p>
                    Мы очень надеемся этой работой привлечь внимание людей к этому замечательному искусству,
                    чтобы больше людей жило музыкой, понимало, что музыка не просто мелодия и слова, а душа
                    людей, выразившаяся в мгновении.
                </p>
                <p>
                    Мы постараемся не ограничиваться своими предпочтениями, а попробуем предложить разные
                    выражения того, куда движется этот поток.
                </p>
                <p>
                    Мы призываем к сотрудничеству тех,кто любит это дело и готов поделиться своими открытиями
                    и теми ценностями,которые смог встретить.
                </p>
                <p>
                    С уважением,<br>
                    Далер Назаров
                </p>
            </div>
        </section>
    </div>
</template>

<script>
    export default {
        name: "AboutUs"
    }
</script>

<style scoped>

</style>
